Tekla Open API Reference for Tekla Structures 2025
GridLine Properties
The GridLine type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the grid line. For more information see GridLine.GridLineAttributes.
EndLabel
 The end of the grid line, contains the grid label and position information. For more information see GridLine.GridLabel.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from ModelObject.)
ModelIdentifier
 The database identifier of the model object in the model database. By using this identifier, it is possible to select the actual object in the Tekla Structures model.
 (Inherited from ModelObject.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
StartLabel
 The beginning of the grid line, contains the grid label and position information. For more information see GridLine.GridLabel.
Top
See Also
Reference
GridLine Class
Tekla.Structures.Drawing Namespace